COMMUNITY_TOKEN = ''
USER_TOKEN = ''

ANSWERS = {
    'first_hello': """
    Привет! VKinder поможет тебе найти вторую половинку в ВКонтакте! 
    """,

    'second_hello': """
    Для начала поиска набери никнейм клиента для которого будем искать пару:
    """,

    'client_found': """
    Клиент найден! Проверяем данные...
    """,

    'client_error': """
    Клиент с таким ником не найден! Введи существующий никнейм или id пользователя ВКонтакте:
    """,

    'main_command_error': """
    Комманда введена неверно! Для запуска бота набери "начать"
    """,

    'search_next': """
    Для просмотра следущего кандидата набери - "дальше", для выхода в главное меню - "выход"
    """,

    'search_help': """
    "дальше" - следующая анкета, "выход" - выход в главное меню, "помощь" - вызов справки
    """,

    'search_finish': """
    Поиск завершён! Для начала нового поиска набери никнейм пользователя ВКонтакте!
    """,

    'search_command_error': """
    Комманда введена неверно, для вызова справки набери "помощь"
    """,

    'users_shown': """
    Показаны все найденные пользователи, для начала нового поиска набери никнейм пользователя!
    """,

    'error_bdate_input': """
    Дата рождения введена некорректно!
    """,

    'bdate_input_format': """
    Укажи дату рождения в формате "11.11.1995":
    """,

    'error_bdate': """
    У выбранного клиента не найдена дата рождения!
    """,

    'error_relation_input': """
    Семейное положение введено некорректно!
    """,

    'relation_input_format': """
    Укажи семейное положение, возможные значения:
    1 — не женат / не замужем
    2 — есть друг / есть подруга
    3 — помолвлен / помолвлена
    4 — женат / замужем
    5 — всё сложно
    6 — в активном поиске
    7 — влюблён / влюблена
    8 — в гражданском браке
    """,

    'error_relation': """
    У выбранного клиента не найдено семейное положение!
    """,

    'error_country_input': """
    Страна указана некорректно!
    """,

    'country_input_format': """
    Укажи страну проживания, например - "Россия":
    """,

    'error_country': """
    У выбранного клиента не найдена страна проживания!
    """,

    'city_input_format': """
    Укажи город проживания, например - "Москва":
    """,

    'error_city': """
    У выбранного клиента не найден город проживания!
    """,

    'saved': """
    Обнаруженны сохранённые результаты! Кандидаты из предыдущих поисков скрыты
    """,

}
